cases/PR1.8/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration   |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// -----------------------------------------------------------------------------

scale 0.0254;

// Geometry in inches.
x0      0;
x1      10;
x2      12;
x3      480;

y0      0;
y1      4;
y2      3.577708764;
y3      160;

// z is the empty extrusion direction.
z0      0;
z1      1;

vertices
(
    // x = 0
    ($x0 $y0 $z0)   // 0
    ($x0 $y1 $z0)   // 1 lower wall
    ($x0 $y0 $z1)   // 2
    ($x0 $y1 $z1)   // 3 lower wall z1

    ($x0 $y1 $z0)   // 4 upper wall
    ($x0 $y3 $z0)   // 5
    ($x0 $y1 $z1)   // 6 upper wall z1
    ($x0 $y3 $z1)   // 7

    // x = 10
    ($x1 $y0 $z0)   // 8
    ($x1 $y1 $z0)   // 9 lower wall
    ($x1 $y0 $z1)   // 10
    ($x1 $y1 $z1)   // 11 lower wall z1

    ($x1 $y1 $z0)   // 12 upper wall
    ($x1 $y3 $z0)   // 13
    ($x1 $y1 $z1)   // 14 upper wall z1
    ($x1 $y3 $z1)   // 15

    // x = 12
    ($x2 $y0 $z0)   // 16
    ($x2 $y2 $z0)   // 17
    ($x2 $y0 $z1)   // 18
    ($x2 $y2 $z1)   // 19
    ($x2 $y3 $z0)   // 20
    ($x2 $y3 $z1)   // 21

    // x = 480
    ($x3 $y0 $z0)   // 22
    ($x3 $y2 $z0)   // 23
    ($x3 $y0 $z1)   // 24
    ($x3 $y2 $z1)   // 25
    ($x3 $y3 $z0)   // 26
    ($x3 $y3 $z1)   // 27
);

blocks
(
    // Lower straight nozzle passage
    hex (0 8 9 1 2 10 11 3) (28 16 1) simpleGrading (1 0.2 1)

    // Upper freestream above the straight section
    hex (4 12 13 5 6 14 15 7) (28 36 1) simpleGrading (1 5 1)

    // Lower convergent passage
    hex (8 16 17 9 10 18 19 11) (10 16 1) simpleGrading (1 0.2 1)

    // Upper convergent freestream
    hex (12 17 20 13 14 19 21 15) (10 36 1) simpleGrading (1 5 1)

    // Downstream plume/core region
    hex (16 22 23 17 18 24 25 19) (72 16 1) simpleGrading (1 0.2 1)

    // Downstream farfield
    hex (17 23 26 20 19 25 27 21) (72 36 1) simpleGrading (1 5 1)
);

boundary
(
    engineInlet
    {
        type patch;
        faces
        (
            (1 0 2 3)
        );
    }

    freestreamInlet
    {
        type patch;
        faces
        (
            (5 4 6 7)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (22 23 25 24)
            (23 26 27 25)
        );
    }

    internalNozzleWall
    {
        type wall;
        faces
        (
            (1 9 11 3)
            (17 9 11 19)
        );
    }

    externalNozzleWall
    {
        type wall;
        faces
        (
            (4 12 14 6)
            (12 17 19 14)
        );
    }

    topSlip
    {
        type patch;
        faces
        (
            (13 5 7 15)
            (13 20 21 15)
            (26 20 21 27)
        );
    }

    axis
    {
        type symmetryPlane;
        faces
        (
            (0 8 10 2)
            (8 16 18 10)
            (16 22 24 18)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 8 9 1)
            (4 12 13 5)
            (8 16 17 9)
            (12 17 20 13)
            (16 22 23 17)
            (17 23 26 20)

            (2 10 11 3)
            (6 14 15 7)
            (10 18 19 11)
            (14 19 21 15)
            (18 24 25 19)
            (19 25 27 21)
        );
    }
);

mergePatchPairs
(
);

// -----------------------------------------------------------------------------
